<HTML>
<TITLE> Насыров Аскар ПИ-323</TITLE>
<BODY>
    Насыров Аскар ПИ-323<p>
    Найти значение переменной z, заданной суммой функций. Для нахождения значения
функции f(u,t) написать пользовательскую функцию. Числа a и b – случайные.<p>
<?php
$a = rand(-50, 49);
$b = rand(-50, 49);
print('a = '. $a . '<br>'); //Выводим

print('b = '. $b . '<br>'); //Выводим

if ((($a-pow($b, 2))>=0) AND (($b-$a) >=0)){
    $z1=$a-pow($b, 2);
}
elseif ((($a-pow($b, 2))<0) AND (($b-$a) >=0)){
  $z1=$b-$a;
}  
elseif ((($a-pow($b, 2))>=0) AND (($b-$a) <0)){
  $z1=($a-pow($b, 2))-2*($b-$a);
} 
elseif ((($a-pow($b, 2))<0) AND (($b-$a) <0)){
  $z1=(($a-pow($b, 2))*($b-$a))+3*($b-$a);
} 
if (($a>=0) AND (($b-pow($a, 2)) >=0)){
    $z2=$a;
}
elseif (($a<0) AND (($b-pow($a, 2)) >=0)){
  $z2=$b-pow($a, 2);
}  
elseif (($a>=0) AND (($b-pow($a, 2)) <0)){
  $z2=$a-2*($b-pow($a, 2));
} 
elseif (($a<0) AND (($b-pow($a, 2)) <0)){
  $z2=$a*($b-pow($a, 2))+3*($b-pow($a, 2));
} 
print('z = f(a-b^2,b-a) + f(a,b-a^2) '. '<br>'); //Выводим
$z=$z1+$z2;
print('f(a-b^2,b-a) = '. $z1 . '<br>'); //Выводим
print('f(a,b-a^2) = '. $z2 . '<br>'); //Выводим
print('z = '. $z); //Выводим
?>
</BODY>
</HTML>